n7space/TASTE-SAMV71-RTEMS-Drivers/src/app/main.c
#include <rtems.h>

#include <samv71_serial_ccsds.h>

#define RUNTIME_TASK_COUNT (1 + 3 + 0)
#define RUNTIME_FUNCTION_COUNT (1 + 2 + (0 * 2))

#define PROVIDED_INTERFACE_COUNT (0 + 1 + 1 + 1)

#define MAX_TLS_SIZE                                                           \
  RTEMS_ALIGN_UP(((64 > (8 * PROVIDED_INTERFACE_COUNT))                        \
                      ? 64                                                     \
                      : (8 * PROVIDED_INTERFACE_COUNT)),                       \
                 RTEMS_TASK_STORAGE_ALIGNMENT)

#define TASK_ATTRIBUTES RTEMS_DEFAULT_ATTRIBUTES

#define TASK_STORAGE_SIZE                                                      \
  RTEMS_TASK_STORAGE_SIZE(MAX_TLS_SIZE + RTEMS_MINIMUM_STACK_SIZE,             \
                          TASK_ATTRIBUTES)

int main() { return 0; }

rtems_task Init(rtems_task_argument argument) {
  (void)rtems_task_delete(RTEMS_SELF);
}

/* void abort() { rtems_fatal(RTEMS_FATAL_SOURCE_EXIT, 0); } */

/* void __assert_func(const char *file, int line, const char *x, const char *y);
 */

/* void __assert_func(const char *file, int line, const char *x, const char *y)
 * { */
/*   rtems_fatal(RTEMS_FATAL_SOURCE_EXIT, 0); */
/* } */

#define CONFIGURE_APPLICATION_NEEDS_CLOCK_DRIVER

#define CONFIGURE_MAXIMUM_PROCESSORS 2

#define CONFIGURE_MAXIMUM_BARRIERS 0

#define CONFIGURE_MAXIMUM_MESSAGE_QUEUES RUNTIME_TASK_COUNT

#define CONFIGURE_MAXIMUM_PARTITIONS 0

#define CONFIGURE_MAXIMUM_PERIODS 0

#define CONFIGURE_MAXIMUM_SEMAPHORES RUNTIME_FUNCTION_COUNT

#define CONFIGURE_MAXIMUM_TASKS RUNTIME_TASK_COUNT

#define CONFIGURE_MINIMUM_TASKS_WITH_USER_PROVIDED_STORAGE                     \
  CONFIGURE_MAXIMUM_TASKS

#define CONFIGURE_MAXIMUM_TIMERS RUNTIME_TASK_COUNT

#define CONFIGURE_MAXIMUM_USER_EXTENSIONS 0

#define CONFIGURE_MICROSECONDS_PER_TICK 1000

#define CONFIGURE_MAXIMUM_FILE_DESCRIPTORS 0

#define CONFIGURE_DISABLE_NEWLIB_REENTRANCY

#define CONFIGURE_APPLICATION_DISABLE_FILESYSTEM

#define CONFIGURE_MAXIMUM_THREAD_LOCAL_STORAGE_SIZE MAX_TLS_SIZE

#define CONFIGURE_RTEMS_INIT_TASKS_TABLE

#define CONFIGURE_INIT_TASK_ATTRIBUTES TASK_ATTRIBUTES | RTEMS_FLOATING_POINT

#define CONFIGURE_INIT_TASK_INITIAL_MODES RTEMS_DEFAULT_MODES

#define CONFIGURE_INIT_TASK_CONSTRUCT_STORAGE_SIZE TASK_STORAGE_SIZE

#define CONFIGURE_INIT

#include <rtems/confdefs.h>
